---   

<h1 align="center">Introduction to Data Analyst and Data Science for beginners</h1>
<h1 align="center">Lecture no 2.12(Pandas-03)</h1>

---
<h3><div align="right">Ehtisham Sadiq</div></h3>

<img align="right" width="400" height="400"  src="images/pandas-apps.png"  >

## _Overview of Pandas Dataframe Data Structure_

#### Read about Pandas Data Structures: https://pandas.pydata.org/docs/user_guide/dsintro.html#dsintro

## Learning agenda of this notebook
1. Anatomy of a Dataframe
2. Creating Dataframe
    - An empty dataframe
    - Two-Dimensional NumPy Array
    - Dictionary of Python Lists
    - Dictionary of Panda Series
2. Attributes of a Dataframe
3. Bonus

In [ ]:
# To install this library in Jupyter notebook
#import sys
#!{sys.executable} -m pip install pandas

In [ ]:
import pandas as pd
pd.__version__ , pd.__path__

<img align="right" width="500" height="500"  src="images/dataframe.webp">


## 1. Creating a Dataframe
<br><br>
>**A Pandas Dataframe is a two-dimensional labeled data structure (like SQL table) with heterogeneously typed columns, having both a row and a column index.**

<br><br><br><br>

**```pd.DataFrame(data=None, index=None, columns=None, dtype=None)```**
- Where,
   - `data`: It can be a 2-D NumPy Array, a Dictionary of Python Lists, or a Dictionary of Panda Series (You can also create a dataframe from a file in CSV, Excel, JSON, HTML format or may be from a database table as well).
   - `index`: These are the row indices. Will default to RangeIndex (0, 1, 2, ..., n), if index argument is not passed and no indexing information is part of input data.
   - `columns`: These are the column indices or labels. Will default to RangeIndex (0, 1, 2, ..., n), if index argument is not passed and no indexing information is part of input data.
   - `dtype`: Data type to force. Only a single dtype is allowed. If None, infer.

### a. Creating an Empty Dataframe

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [2]:
df.columns, df.index, df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Empty DataFrame

(Index([], dtype='object'), Index([], dtype='object'), None)

### b. Creating a Dataframe from a 2-D NumPy Array

In [4]:
# creating 1D Array
np.random.randint(10,100,(20,5))

array([[84, 44, 57, 91, 67],
       [73, 87, 59, 39, 93],
       [53, 21, 26, 80, 68],
       [58, 67, 55, 68, 55],
       [76, 48, 51, 73, 98],
       [30, 19, 36, 48, 39],
       [78, 68, 18, 71, 30],
       [95, 67, 60, 32, 92],
       [12, 66, 50, 93, 96],
       [99, 13, 68, 50, 93],
       [75, 60, 78, 41, 28],
       [40, 41, 64, 64, 63],
       [98, 93, 91, 19, 10],
       [85, 60, 10, 39, 85],
       [47, 55, 76, 18, 77],
       [16, 76, 63, 47, 87],
       [60, 75, 90, 46, 37],
       [83, 16, 89, 91, 82],
       [64, 73, 51, 51, 39],
       [86, 31, 44, 52, 77]])

In [5]:
arr = np.random.randint(10,100, size= (6,5))
print("Numpy Array:\n",arr)

Numpy Array:
 [[98 72 84 50 48]
 [20 66 99 70 20]
 [70 15 27 68 99]
 [60 51 85 70 53]
 [42 80 48 47 49]
 [77 35 74 42 44]]

In [6]:
df = pd.DataFrame(data=arr)
print("Pandas Dataframe:\n")
df

Pandas Dataframe:

    0   1   2   3   4
0  98  72  84  50  48
1  20  66  99  70  20
2  70  15  27  68  99
3  60  51  85  70  53
4  42  80  48  47  49
5  77  35  74  42  44

- Note that both the row indices and the column labels/indices are implicitly set to numerical values from 0 to n-1, since neither of the two is provided while creating the dataframe object. They are also not considered as part of data in the dataframe.
- In majority of the cases the row label is left as default, i.e., 0,1,2,3.... However, the column labels are changed from 0,1,2,3,... to some meaningful values.

In [7]:
# Let us name the column labels of our choice, while creating it
col_labels=['Col1', 'Col2', 'Col3', 'Col4', 'Col5']
df = pd.DataFrame(data=arr, columns=col_labels)
df

   Col1  Col2  Col3  Col4  Col5
0    98    72    84    50    48
1    20    66    99    70    20
2    70    15    27    68    99
3    60    51    85    70    53
4    42    80    48    47    49
5    77    35    74    42    44

In [8]:
# Let us name the row labels of our choice, while creating it
df = pd.DataFrame(data=arr, index=['Row0', 'Row1', 'Row2', 'Row3', 'Row4', 'Row5'])
df

       0   1   2   3   4
Row0  98  72  84  50  48
Row1  20  66  99  70  20
Row2  70  15  27  68  99
Row3  60  51  85  70  53
Row4  42  80  48  47  49
Row5  77  35  74  42  44

In [9]:
# Let us name the both row labels and column labels to strings of our choice, while creating it
row_labels = ['Row0', 'Row1', 'Row2', 'Row3', 'Row4', 'Row5']
col_labels = ['Col0', 'Col1', 'Col2', 'Col3', 'Col4']
df = pd.DataFrame(data=arr, index=row_labels, columns=col_labels)
df

      Col0  Col1  Col2  Col3  Col4
Row0    98    72    84    50    48
Row1    20    66    99    70    20
Row2    70    15    27    68    99
Row3    60    51    85    70    53
Row4    42    80    48    47    49
Row5    77    35    74    42    44

- You can do this later as well, i.e., after the dataframe has been created with default indices.
- This is done by assigning a list of labels/values to `index` and `columns` attributes of a dataframe object.

In [10]:
arr = np.random.randint(10,100, size= (6,5))
df = pd.DataFrame(data=arr)
df

    0   1   2   3   4
0  89  11  26  15  87
1  98  85  90  97  83
2  47  33  85  75  65
3  48  31  30  13  65
4  39  19  29  16  82
5  94  52  99  72  59

In [11]:
row_labels = ['Row0', 'Row1', 'Row2', 'Row3', 'Row4', 'Row5']
col_labels = ['Col0', 'Col1', 'Col2', 'Col3', 'Col4']

In [13]:
df.index = row_labels
df

       0   1   2   3   4
Row0  89  11  26  15  87
Row1  98  85  90  97  83
Row2  47  33  85  75  65
Row3  48  31  30  13  65
Row4  39  19  29  16  82
Row5  94  52  99  72  59

In [14]:
df.columns = col_labels
df

      Col0  Col1  Col2  Col3  Col4
Row0    89    11    26    15    87
Row1    98    85    90    97    83
Row2    47    33    85    75    65
Row3    48    31    30    13    65
Row4    39    19    29    16    82
Row5    94    52    99    72    59

### c. Creating a Dataframe from a Dictionary of Python Lists
- You can create a dataframe object from a dictionary of Python Lists 
    - The dictionary `Keys` become the column names, and 
    - The dictionary `Values` are lists/arrays containing data for the respective columns.

In [182]:
people = {
    "name" : ["Ehtisham", "Ali", "Ayesha", "Dua", "Khubaib", "Adeen"],
    "age" : [21, 20, 18, 17, 12, 10],
    "address": ["Lahore", "Karachi", "Lahore", "Islamabad", "Kakul", "Karachi"],
    "cell" : ["321-123", "320-431", "321-478", "324-446", "321-967", "320-678"],
    "bg": ["B+", "A-", "B+", "O-", "A-", "B+"]
}
people

{'name': ['Ehtisham', 'Ali', 'Ayesha', 'Dua', 'Khubaib', 'Adeen'],
 'age': [21, 20, 18, 17, 12, 10],
 'address': ['Lahore', 'Karachi', 'Lahore', 'Islamabad', 'Kakul', 'Karachi'],
 'cell': ['321-123', '320-431', '321-478', '324-446', '321-967', '320-678'],
 'bg': ['B+', 'A-', 'B+', 'O-', 'A-', 'B+']}

In [183]:
# Pass this Dictionary of Python Lists to pd.Dataframe()
df_people = pd.DataFrame(data=people)
df_people

       name  age    address     cell  bg
0  Ehtisham   21     Lahore  321-123  B+
1       Ali   20    Karachi  320-431  A-
2    Ayesha   18     Lahore  321-478  B+
3       Dua   17  Islamabad  324-446  O-
4   Khubaib   12      Kakul  321-967  A-
5     Adeen   10    Karachi  320-678  B+

In [184]:
df_people.to_html('datasets/df_people.html')

- Note that column labels are set as per the keys inside the dictionary object, while the row labels/indices are set to default numerical values.
- You can set the row indices while creating the dataframe by passing the index argument to `pd.DataFrame()` method, or can do that later by assigning the new values to the `index` and `columns` attributes of a dataframe object.

In [17]:
# Let us change the row labels of above dataframe
row_labels = ['MS01', 'MS02', 'MS03', 'MS04', 'MS05', 'MS06']
df_people.index = row_labels
df_people

          name  age    address     cell  bg
MS01  Ehtisham   21     Lahore  321-123  B+
MS02       Ali   20    Karachi  320-431  A-
MS03    Ayesha   18     Lahore  321-478  B+
MS04       Dua   17  Islamabad  324-446  O-
MS05   Khubaib   12      Kakul  321-967  A-
MS06     Adeen   10    Karachi  320-678  B+

### d. Creating a Dataframe from Dictionary of Panda Series
One can think of a dataframe as a dictionary of Panda Series: 
- `Keys` are column names, and 
- `Values` are Series object for the respective columns.

In [18]:
dict1 = {
    "name": pd.Series(['Ehtisham', 'Ali', 'Ayesha']),
    "age": pd.Series([21, 19, 16]),
    "addr": pd.Series(['Lahore', 'Islamabad','Karachi']),
}a
dict1

{'name': 0    Ehtisham
 1         Ali
 2      Ayesha
 dtype: object,
 'age': 0    21
 1    19
 2    16
 dtype: int64,
 'addr': 0       Lahore
 1    Islamabad
 2      Karachi
 dtype: object}

In [19]:
pd.DataFrame(dict1)

       name  age       addr
0  Ehtisham   21     Lahore
1       Ali   19  Islamabad
2    Ayesha   16    Karachi

>Note from the above output, that every series object becomes the data of the appropriate column. Moreover, the keys of the dictionary become the column labels.

In [24]:
# if elements of series are differnt
dict1 = {
    "name": pd.Series(['Ehtisham', 'Ali', 'Ayesha','Dua']),
    "age": pd.Series([21, 19, 16]),
    "addr": pd.Series(['Lahore', 'Islamabad','Karachi']),
}
pd.DataFrame(dict1)

       name   age       addr
0  Ehtisham  21.0     Lahore
1       Ali  19.0  Islamabad
2    Ayesha  16.0    Karachi
3       Dua   NaN        NaN

In [22]:
dict1 = {
    "name": pd.Series(data=['Ehtisham', 'Ali', 'Ayesha', 'Dua'], index=['a','b','c', 'd']),
    "age": pd.Series(data=[21, 22,np.nan, 18], index=['a','b','c','d']),
    "addr": pd.Series(data=['Lahore', 'Peshawer','Karachi'], index=['a','b', 'd']),
}
df = pd.DataFrame(dict1)
df

       name   age      addr
a  Ehtisham  21.0    Lahore
b       Ali  22.0  Peshawer
c    Ayesha   NaN       NaN
d       Dua  18.0   Karachi

>- In the above code and its output, note that every series object has four data values and four corresponding indices.
>- Also note that in the `age` series, we have a NaN value, and in the `addr` series we have an empty string.
>- Another point to note that the row indices of the three series exactly match, in number as well as in sequence/value.
>- A question arise, what if the indices of series are different. See the following code to understand this concept.

In [25]:
dict1 = {
    "name": pd.Series(data=['Ehtisham', 'Ali', 'Ayesha', 'Dua'], index=['a','b','c', 'd']),
    "age": pd.Series(data=[21, 22,np.nan, 18], index=['a','x','y','d']),
    "addr": pd.Series(data=['Lahore', '','Karachi'], index=['a', 'd', 'x']),
}
df = pd.DataFrame(dict1)
df

       name   age     addr
a  Ehtisham  21.0   Lahore
b       Ali   NaN      NaN
c    Ayesha   NaN      NaN
d       Dua  18.0
x       NaN  22.0  Karachi
y       NaN   NaN      NaN

>- In the above code and its output, note that first series object has four data values and four corresponding indices. Similarly, second series object has four data values (with one `np.nan` value) and four corresponding indices, which are a bit different from the first series object. Third series has three data values (with one empty string) and three indices.
>- Note the resulting Dataframe has six rows and three columns.
    - For index 'a' we have value in all the three series objects or columns.
    - For index 'b' we have a value in first series object, and NaN for the second and third column, since the second and third series object has no value corresponding to row index 'b.

## 3. Attributes of Pandas Dataframe
- Like Series, we can access properties/attributes of a dataframe by using dot `.` notation

In [26]:
people = {
    "name" : ["Ehtisham", "Ali", "Ayesha", "Dua", "Khubaib", "Adeen"],
    "age" : [21, 20, 18, 17, 12, 10],
    "address": ["Lahore", "Karachi", "Lahore", "Islamabad", "Kakul", "Karachi"],
    "cell" : ["321-123", "320-431", "321-478", "324-446", "321-967", "320-678"],
    "bg": ["B+", "A-", "B+", "O-", "A-", "B+"]
}
# people

df_people = pd.DataFrame(data=people, index=['MS01', 'MS02', 'MS03', 'MS04', 'MS05', 'MS06'])
df_people

          name  age    address     cell  bg
MS01  Ehtisham   21     Lahore  321-123  B+
MS02       Ali   20    Karachi  320-431  A-
MS03    Ayesha   18     Lahore  321-478  B+
MS04       Dua   17  Islamabad  324-446  O-
MS05   Khubaib   12      Kakul  321-967  A-
MS06     Adeen   10    Karachi  320-678  B+

In [27]:
# `shape` attribute of a dataframe object return a two value tuple containing rows and columns
# Note the rows count does not include the column labels and column count does not include the row index
df_people.shape

(6, 5)

In [28]:
# `ndim` attribute of a dataframe object returns number of dimensions (which is always 2)
df_people.ndim

2

In [29]:
# `size` attribute of a dataframe object returns the number of elements in the underlying data
df_people.size

30

In [30]:
# `index` attribute of a dataframe object return the list of row indices and its datatype
df_people.index

Index(['MS01', 'MS02', 'MS03', 'MS04', 'MS05', 'MS06'], dtype='object')

In [31]:
# `columns` attribute of a dataframe object return the list of column labels and its datatype
df_people.columns

Index(['name', 'age', 'address', 'cell', 'bg'], dtype='object')

In [32]:
#This attribute is used to fetch both index and column names.
df_people.axes

[Index(['MS01', 'MS02', 'MS03', 'MS04', 'MS05', 'MS06'], dtype='object'),
 Index(['name', 'age', 'address', 'cell', 'bg'], dtype='object')]

In [33]:
# `values` attribute of a dataframe object returns a NumPy 2-D having all the values in the DataFrame, 
# without the row indices and column labels
df_people.values

array([['Ehtisham', 21, 'Lahore', '321-123', 'B+'],
       ['Ali', 20, 'Karachi', '320-431', 'A-'],
       ['Ayesha', 18, 'Lahore', '321-478', 'B+'],
       ['Dua', 17, 'Islamabad', '324-446', 'O-'],
       ['Khubaib', 12, 'Kakul', '321-967', 'A-'],
       ['Adeen', 10, 'Karachi', '320-678', 'B+']], dtype=object)

In [35]:
df.empty

False

In [34]:
# `dtypes` attribute of a dataframe object return the data type of each column in the dataframe
df_people.dtypes

name       object
age         int64
address    object
cell       object
bg         object
dtype: object

In [37]:
df_people.isnull().sum()

name       0
age        0
address    0
cell       0
bg         0
dtype: int64

In [36]:
# To check number on non-NA values
df_people.count()

name       6
age        6
address    6
cell       6
bg         6
dtype: int64

In [41]:
df_people['address'].unique()d

array(['Lahore', 'Karachi', 'Islamabad', 'Kakul'], dtype=object)

In [45]:
df_people.describe(include='all')

            name        age address     cell   bg
count          6   6.000000       6        6    6
unique         6        NaN       4        6    3
top     Ehtisham        NaN  Lahore  321-123   B+
freq           1        NaN       2        1    3
mean         NaN  16.333333     NaN      NaN  NaN
std          NaN   4.412105     NaN      NaN  NaN
min          NaN  10.000000     NaN      NaN  NaN
25%          NaN  13.250000     NaN      NaN  NaN
50%          NaN  17.500000     NaN      NaN  NaN
75%          NaN  19.500000     NaN      NaN  NaN
max          NaN  21.000000     NaN      NaN  NaN

In [43]:
df_people.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, MS01 to MS06
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     6 non-null      object
 1   age      6 non-null      int64
 2   address  6 non-null      object
 3   cell     6 non-null      object
 4   bg       6 non-null      object
dtypes: int64(1), object(4)
memory usage: 288.0+ bytes

# Bonus

#### The `df.info()` Method

In [ ]:
#This method prints information about a DataFrame including the row indices, column labels, 
# non-null values count in each column, datatype and memory usage
df_people.info()

#### The `df.describe()` Method

In [ ]:
# This method prints the descriptive view of all the columns of dataset which are numeric
df.describe()

## Check Your Concepts:
- What is Dataframe in pandas?
- Make a Pandas DataFrame with two-dimensional list | Python 
- Python | Creating DataFrame from dict of narray/lists 
- Python | Creating DataFrame from dict of narray/lists 
- Creating Pandas dataframe using list of lists 
- Creating a Pandas dataframe using list of tuples 
- Create a Pandas DataFrame from List of Dicts 
- Python | Convert list of nested dictionary into Pandas dataframe 
- Replace values in Pandas dataframe using regex 
- Creating a dataframe from Pandas series 
- Construct a DataFrame in Pandas using string data 
- Clean the string data in the given Pandas Dataframe 
- Reindexing in Pandas DataFrame 
- Mapping external values to dataframe values in Pandas 
- Reshape a pandas DataFrame using stack, unstack and melt method 
- Reset Index in Pandas Dataframe 
- Python | Change column names and row indexes in Pandas DataFrame

In [46]:
# creating a dataframe from 2D list
list2d = [[2,3,4,5,6,7],[8,6,7,5,4,2]]
list2d

[[2, 3, 4, 5, 6, 7], [8, 6, 7, 5, 4, 2]]

In [47]:
pd.DataFrame(list2d)

   0  1  2  3  4  5
0  2  3  4  5  6  7
1  8  6  7  5  4  2

In [53]:
# creating a dataframe from a dictionary of numpy-arrays
dict_narrays = {
    'age':np.random.randint(20,30,10),
    'marks':np.random.randint(70,100,10),
    
}
pd.DataFrame(dict_narrays)

   age  marks
0   21     82
1   23     92
2   24     91
3   20     99
4   22     83
5   28     93
6   29     95
7   20     97
8   20     72
9   29     93

In [58]:
# creating a dataframe from list of lists
one , two = list2d[0], list2d[1]
dict_lists = {
    'col1':one,
    'col2':two
}
pd.DataFrame(data=dict_lists)

   col1  col2
0     2     8
1     3     6
2     4     7
3     5     5
4     6     4
5     7     2

In [73]:
# creating a dataframe using list of tuples
age = tuple(np.random.randint(20,30,10))
marks = tuple(np.random.randint(70,100,10))
list_of_tuples = [age,marks]
dict_tuples = {
    'age':list_of_tuples[0],
    'marks':list_of_tuples[1]
}
list_of_tuples

[(25, 26, 23, 24, 25, 28, 21, 23, 27, 21),
 (87, 83, 81, 71, 99, 94, 91, 98, 80, 84)]

In [74]:
pd.DataFrame(data=list_of_tuples)

    0   1   2   3   4   5   6   7   8   9
0  25  26  23  24  25  28  21  23  27  21
1  87  83  81  71  99  94  91  98  80  84

In [75]:
pd.DataFrame(data=dict_tuples)

   age  marks
0   25     87
1   26     83
2   23     81
3   24     71
4   25     99
5   28     94
6   21     91
7   23     98
8   27     80
9   21     84

In [77]:
# creating a dataframe from list of dictionaries
data = [{7058: 'sravan', 7059: 'jyothika',
         7072: 'harsha', 7075: 'deepika'},
         
        {7051: 'fathima', 7089: 'mounika',
         7012: 'thanmai', 7115: 'vasavi'},
         
        {9001: 'ojaswi', 1289: 'daksha',
         7045: 'parvathi', 9815: 'bhavani'}]
pd.DataFrame(data=data)

,7058,7059,7072,7075,7051,7089,7012,7115,9001,1289,7045,9815
0,sravan,jyothika,harsha,deepika,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,fathima,mounika,thanmai,vasavi,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,ojaswi,daksha,parvathi,bhavani

In [78]:
ls_dict = [{'py': 'Python', 'mat': 'MATLAB', 'cs': 'Csharp'}, 
{'A': 65, 'B': 66, 'C': 67}, 
{'a': 97, 'b': 98, 'c': 99}]
  
pd.DataFrame(ls_dict)

       py     mat      cs     A     B     C     a     b     c
0  Python  MATLAB  Csharp   NaN   NaN   NaN   NaN   NaN   NaN
1     NaN     NaN     NaN  65.0  66.0  67.0   NaN   NaN   NaN
2     NaN     NaN     NaN   NaN   NaN   NaN  97.0  98.0  99.0

In [79]:
students = [
  { 'name': 'Theodore', 'age': 18 },
  { 'name': 'Mathew', 'age': 22 },
  { 'name': 'Roxanne', 'age': 20 },
  { 'name': 'David', 'age': 18 }
]
pd.DataFrame(students)

       name  age
0  Theodore   18
1    Mathew   22
2   Roxanne   20
3     David   18

In [84]:
# # get values from list of dictionary on the basis of a specific key
# for i in students:
#     print(i.get('age'))
# [i.get('age') for i in students]

In [142]:
# list of nested dictionary in Pandas dataframe
list1 = [
   {
      "Fruit": [{"Price": 15.2, "Quality": "A"},
         {"Price": 19, "Quality": "B"},
         {"Price": 17.8, "Quality": "C"},
      ],
      "Name": "Orange"
   },
   {
      "Fruit": [{"Price": 23.2, "Quality": "A"},
         {"Price": 28, "Quality": "B"}
      ],
      "Name": "Grapes"
   }
]
# pd.DataFrame(list1)
# list1[0]['Fruit'][0]
Fruit_lists = []
price = []
quality = []
for i in list1:
    for j in i['Fruit']:
        price.append(j['Price'])
        quality.append(j['Quality'])

In [143]:
price, quality

([15.2, 19, 17.8, 23.2, 28], ['A', 'B', 'C', 'A', 'B'])

In [144]:
# Fruit_lists
for i in list1:
    if i.get('Name') =='Orange':
#         print(i.get('Name')*3)
        for j in range(3):
            Fruit_lists.append(i.get('Name'))
    else:
        for k in range(2):
            Fruit_lists.append(i.get('Name'))

In [145]:
Fruit_lists

['Orange', 'Orange', 'Orange', 'Grapes', 'Grapes']

In [146]:
pd.DataFrame(data={'Fruits':Fruit_lists,
                  'Price':price,
                  'Quality':quality})

   Fruits  Price Quality
0  Orange   15.2       A
1  Orange   19.0       B
2  Orange   17.8       C
3  Grapes   23.2       A
4  Grapes   28.0       B

In [150]:
# Given nested dictionary
list3 = [
   {
      "Fruit": [{"Price": 15.2, "Quality": "A"},
         {"Price": 19, "Quality": "B"},
         {"Price": 17.8, "Quality": "C"},
      ],
      "Name": "Orange"
   },
   {
      "Fruit": [{"Price": 23.2, "Quality": "A"},
         {"Price": 28, "Quality": "B"}
      ],
      "Name": "Grapes"
   }
]

rows = []

# Getting rows
for data in list3:
    data_row = data['Fruit']
    n = data['Name']
    for row in data_row:
        row['Name'] = n
        rows.append(row)

rows

[{'Price': 15.2, 'Quality': 'A', 'Name': 'Orange'},
 {'Price': 19, 'Quality': 'B', 'Name': 'Orange'},
 {'Price': 17.8, 'Quality': 'C', 'Name': 'Orange'},
 {'Price': 23.2, 'Quality': 'A', 'Name': 'Grapes'},
 {'Price': 28, 'Quality': 'B', 'Name': 'Grapes'}]

In [155]:
li= []
for data in list3:
#     print(data)
    fruit_list = data['Fruit']
    name = data['Name']
    for value in fruit_list:
        value['Name'] = name
        li.append(value)
#         print(value)
        
    
#     print("\n\n\n")
li

[{'Price': 15.2, 'Quality': 'A', 'Name': 'Orange'},
 {'Price': 19, 'Quality': 'B', 'Name': 'Orange'},
 {'Price': 17.8, 'Quality': 'C', 'Name': 'Orange'},
 {'Price': 23.2, 'Quality': 'A', 'Name': 'Grapes'},
 {'Price': 28, 'Quality': 'B', 'Name': 'Grapes'}]

In [157]:
new = pd.DataFrame(li)
new

   Price Quality    Name
0   15.2       A  Orange
1   19.0       B  Orange
2   17.8       C  Orange
3   23.2       A  Grapes
4   28.0       B  Grapes

In [159]:
# Replace values in Pandas dataframe using regex

In [166]:
# importing pandas as pd
import pandas as pd
import re
  
# Let's create a Dataframe
df = pd.DataFrame({'City':['New York (City)', 'Parague', 'New Delhi (Delhi)', 'Venice', 'new Orleans'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy', 'Tech_Summit'],
                    'Cost':[10000, 5000, 15000, 2000, 12000]})
  
# aLet's create the index


# index_ = [pd.Period('02-2018'), pd.Period('04-2018'),
#           pd.Period('06-2018'), pd.Period('10-2018'), pd.Period('12-2018')]
  
# Set the index
# df.index = index_
  
# Let's print the dataframe
# print(df)
df

                City        Event   Cost
0    New York (City)        Music  10000
1            Parague       Poetry   5000
2  New Delhi (Delhi)      Theatre  15000
3             Venice       Comedy   2000
4        new Orleans  Tech_Summit  12000

In [169]:
df.City.str.replace(r'\(.*','', regex=True)

0      New York
1        Parague
2     New Delhi
3         Venice
4    new Orleans
Name: City, dtype: object

In [165]:
def clean_city(value):
    if re.search('\(.*', value):
        pos = re.search('\(.*', value).start()
        return value[:pos]
    else:
        return value
    
df.City = df.City.apply(clean_city)
df

          City        Event   Cost
0    New York         Music  10000
1      Parague       Poetry   5000
2   New Delhi       Theatre  15000
3       Venice       Comedy   2000
4  new Orleans  Tech_Summit  12000

In [179]:
import pandas as pd

# Creating a dictionary
d = {'Col':['$1100,000*','$40000 string created','4m4']}

# Creating a dataframe
df = pd.DataFrame(d)
df.Col.str.replace(r'\D+','', regex=True)

0    1100000
1      40000
2         44
Name: Col, dtype: object

# Pandas  - Assignment no 03
- Here is link of [Pandas - Assignment no 03]()